posts/2016-01-30-gifts-both-great-and-small.org
#+date: <2016-01-30>
#+filetags: prayer religion
#+title: Gifts Both Great and Small

A prayer prompted by praying with friends in Ghana who pray and give thanks for everything, from resting well through the night to waking up the next morning.

Gracious God,

As I begin the day,\\
may I remember\\
to trust in your grace\\
for what I need,\\
no matter how great,\\
no matter how small.

And as I end this day,\\
may I remember to give thanks\\
for what I have been given,\\
no matter how great,\\
no matter how small.

For every good thing\\
is a gift from you,\\
and even a small gift\\
is priceless when received\\
from the hand of God.

Amen


#+begin_tagline
Tagged: [[file:../tags/prayer.org][Prayer]] [[file:../tags/religion.org][Religion]]
#+end_tagline
