docs/posts/2016-01-30-gifts-both-great-and-small.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gifts Both Great and Small</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Gifts Both Great and Small</h1>
<p class="subtitle" role="doc-subtitle">Jan 30, 2016</p>
</header><p>
A prayer prompted by praying with friends in Ghana who pray and give thanks for everything, from resting well through the night to waking up the next morning.
</p>

<p>
Gracious God,
</p>

<p>
As I begin the day,<br>
may I remember<br>
to trust in your grace<br>
for what I need,<br>
no matter how great,<br>
no matter how small.
</p>

<p>
And as I end this day,<br>
may I remember to give thanks<br>
for what I have been given,<br>
no matter how great,<br>
no matter how small.
</p>

<p>
For every good thing<br>
is a gift from you,<br>
and even a small gift<br>
is priceless when received<br>
from the hand of God.
</p>

<p>
Amen
</p>


<div class="tagline" id="org03174c1">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
